{
  "backend/main.mo": "Empty Motoko actor placeholder with no logic.",
  "feature_evidence.json": "Feature evidence report listing features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing major frontend components and hooks for the birthday flow app.",
  "frontend/index.css": "Empty stylesheet placeholder.",
  "frontend/index.html": "Base HTML document loading fonts, mounting root div, and bootstrapping the React app.",
  "frontend/src/App.tsx": "Main React component orchestrating the 6-step birthday flow, global UI toggles, overlays, and step rendering.",
  "frontend/src/components/birthday/BirthdayLayout.tsx": "Layout wrapper providing background visuals, looping audio handling, and footer, wrapping main birthday content.",
  "frontend/src/components/birthday/CelebrationBurst.tsx": "Generates a one-time celebratory particle burst using animated colored dots.",
  "frontend/src/components/birthday/collectibles/EasterEggCollectible.tsx": "Hidden collectible button that awards a collectible on click with animation and sound.",
  "frontend/src/components/birthday/minigame/PopQuoteOverlay.tsx": "Displays temporary floating quote bubbles at given coordinates, adding and auto-removing them with optional reduced-motion animation.",
  "frontend/src/components/birthday/minigame/popQuotes.ts": "Stores a list of inspirational quotes and provides a function to return a non-repeating random quote.",
  "frontend/src/components/birthday/modals/BirthdayNoteModal.tsx": "Shows an animated birthday note modal with a writable message, achievements display, and a download option.",
  "frontend/src/components/birthday/modals/MiniGameModal.tsx": "Implements a balloon-popping minigame with sound, achievements, and floating quotes that appear when balloons are popped.",
  "frontend/src/components/birthday/notifications/ToastLayer.tsx": "Provides a top‑center toast notification layer using the Sonner Toaster.",
  "frontend/src/components/birthday/ProgressIndicator.tsx": "Displays current progress across the 6-step flow with completed and active step indicators.",
  "frontend/src/components/birthday/SparkleTrailOverlay.tsx": "Pointer-tracking sparkle effect that spawns and fades sparkles when enabled unless reduced motion is preferred.",
  "frontend/src/components/birthday/steps/StepBirthdayNote.tsx": "Automatically opens the birthday note modal and allows reopening it after the first view.",
  "frontend/src/components/birthday/steps/StepBouquet.tsx": "Handles revealing a bouquet image, awarding an achievement, and advancing the step once revealed.",
  "frontend/src/components/birthday/steps/StepCakeCandles.tsx": "Displays an interactive candle-blowing activity based on age, awarding an achievement once all candles are extinguished.",
  "frontend/src/components/birthday/steps/StepGiftboxSmilies.tsx": "Renders a gift box step that triggers a smiley burst, plays sound, and awards an achievement when opened.",
  "frontend/src/components/birthday/steps/StepMiniGame.tsx": "Displays a mini‑game modal requiring balloon popping to proceed and tracks win state.",
  "frontend/src/components/birthday/steps/StepWish.tsx": "Handles age input, validation, and a celebratory transition before advancing the birthday flow.",
  "frontend/src/components/birthday/steps/WishDecorations.tsx": "Provides decorative background elements and animated stickers for wish-related screens.",
  "frontend/src/components/RuntimeErrorBoundary.tsx": "Error boundary component that catches runtime errors and displays a recovery UI with refresh/reset options.",
  "frontend/src/features/achievements/achievements.ts": "Defines achievement metadata and a helper to fetch an achievement by ID.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries on identity changes.",
  "frontend/src/hooks/useBirthdayFlow.ts": "Zustand store managing birthday flow state, steps, achievements, collectibles, audio, and progression logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity auth context with login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects and returns the user's prefers‑reduced‑motion setting.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are required.",
  "frontend/src/hooks/useSfx.ts": "React hook that caches and plays short sound effects with mute/armed checks and overlapping playback support.",
  "frontend/src/index.css": "Tailwind base/theme setup defining light/dark OKLCH color variables, fonts, and custom celebratory styles.",
  "frontend/src/main.tsx": "Application entry point that mounts React, sets up React Query, and wraps the app with the Internet Identity provider.",
  "frontend/src/utils/deploymentSlug.ts": "Utilities to validate, sanitize, and produce safe deployment slugs with fallback behavior.",
  "frontend/src/utils/deploymentSlugFromEnv.ts": "Reads deployment slug from env or document.title, sanitizes it, logs modifications, and provides a safe slug.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, fonts, shadows, and animations using CSS variables.",
  "project_state.json": "Project metadata describing the birthday experience, architecture notes, known issues, and existing features."
}