{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Deployment-safe publish readiness for Birthday Experience",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Harden the app against production runtime failures so the published URL reliably renders Step 1 without a blank screen.",
      "acceptanceCriteria": [
        "A production deployment is created successfully (no deployment/go-live errors).",
        "The published URL loads the app and renders Step 1 without a blank screen or console-fatal runtime errors."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RuntimeErrorBoundary.tsx",
          "operation": "create",
          "description": "Add a React error boundary that renders a minimal recovery UI (including a refresh/restart suggestion) to prevent a blank screen if an uncaught render error occurs in production."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wrap the existing BirthdayLayout/step rendering in the new RuntimeErrorBoundary so unexpected runtime errors do not result in a blank screen and Step 1 can still load when no error is present."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Ensure any configured/user-provided deployment slug is validated and sanitized to meet platform constraints, using existing slug utilities.",
      "acceptanceCriteria": [
        "The deployment process does not fail due to an invalid domain/slug format.",
        "If a user-provided or configured slug is invalid, it is sanitized or replaced with a safe fallback that passes validation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/deploymentSlug.ts",
          "operation": "modify",
          "description": "Extend the existing slug helpers to better support deployment-time configuration (e.g., export a single helper that takes a potentially-invalid slug and returns a guaranteed-safe slug plus optional diagnostics), while preserving the current validation/sanitization rules."
        },
        {
          "path": "frontend/src/utils/deploymentSlugFromEnv.ts",
          "operation": "create",
          "description": "Add a small utility that reads a slug from frontend configuration (e.g., build-time env) and always returns a safe slug via getSafeDeploymentSlug, so the build/deploy workflow can consume a compliant value without failing."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Ensure Step 6 reliably auto-opens the Birthday Note modal, keeps it open until explicitly closed, and supports reopening and restart on live deployment.",
      "acceptanceCriteria": [
        "On the live deployment, completing Steps 1–5 and reaching Step 6 automatically opens the Birthday Note modal and it remains open until the user closes it.",
        "After closing the note on Step 6, the UI provides a working control to re-open the note without restarting the experience.",
        "Restarting the experience still works from Step 6."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/birthday/modals/BirthdayNoteModal.tsx",
          "operation": "modify",
          "description": "Adjust the modal behavior so it does not unintentionally close via backdrop/Escape interactions (only explicit close UI), while continuing to use the shadcn-ui Dialog/DialogContent primitives (verify the component's usage instructions before implementing)."
        },
        {
          "path": "frontend/src/components/birthday/steps/StepBirthdayNote.tsx",
          "operation": "modify",
          "description": "Add small Step 6 robustness tweaks (e.g., stable control visibility/state handling for the reopen button) to guarantee the note can be reopened after closing without restarting."
        }
      ]
    }
  ]
}